Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОВалютныхОперациях/РЭЙ_СправкаОВалютныхОперациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_СправкаОВалютныхОперациях</name>
  <registerRecords>InformationRegister.РЭЙ_СправкиВалютногоКонтроля</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыОперацийСправкаОВалютныхОперациях</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инобанк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоСделке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоВК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйВК</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВалютныеОперации</name>
    <attributes>
      <name>АвансоваяСправка</name>
      <type>
        <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
      </type>
    </attributes>
    <attributes>
      <name>АвансовыйРасчетныйДокумент</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации_1_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации_3_5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходныйНомерСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрактВЭД</name>
      <type>
        <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПаспортСделки</name>
      <type>
        <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредставленияДокументов</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПредставленияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВозвратаАванса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВалютныеОперацииРучные</name>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации_1_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВалютнойОперации_3_5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтракта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрактВЭД</name>
      <type>
        <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКонтракта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПаспортСделки</name>
      <type>
        <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредставленияДокументов</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПредставленияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВозвратаАванса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <comment>(Общ) Банковский счет организации</comment>
      <type>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.РЭЙ_БанковскиеСчетаВалютные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/РЭЙ_ПризнакиПоставки/РЭЙ_ПризнакиПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_ПризнакиПоставки</name>
  <enumValues>
    <name>ИсполнениеРезидентомОбязательствВСчетАвансаОтНерезидента</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеРезидентомОтсрочкиОплатыНерезиденту</name>
  </enumValues>
  <enumValues>
    <name>ИсполнениеНерезидентомОбязательствВСчетАвансаОтРезидента</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеНерезидентомОтсрочкиОплатыРезиденту</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОВалютныхОперациях/Forms/ФормаВыбораАвансовойСправки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СПД.Ссылка КАК Справка,
	|	СПД.Документ КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА СПД.ВалютаДокумента = СПД.Ссылка.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА СПД.СуммаВВалютеДокумента
	|		ИНАЧЕ СПД.СуммаВВалютеКонтракта
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ АвансовыеСПД
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК СПД
	|ГДЕ
	|	СПД.Ссылка.Проведен
	|	И СПД.Ссылка В(&СсылкиСПД)
	|	И СПД.Ссылка.КонтрактВЭД = &КонтрактВЭД
	|	И СПД.ПризнакПоставки = ЗНАЧЕНИЕ(Перечисление.РЭЙ_ПризнакиПоставки.ПредоставлениеРезидентомОтсрочкиОплатыНерезиденту)
	|	И СПД.Ссылка.Дата <= &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СВО.АвансоваяСправка,
	|	СВО.АвансовыйРасчетныйДокумент,
	|	СУММА(ВЫБОР
	|			КОГДА СВО.ВалютаДокумента = СВО.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|				ТОГДА СВО.СуммаВВалютеДокумента
	|			ИНАЧЕ СВО.СуммаВВалютеКонтракта
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ЗакрытыеСПД
	|ИЗ
	|	Документ.РЭЙ_СправкаОВалютныхОперациях.ВалютныеОперации КАК СВО
	|ГДЕ
	|	СВО.Ссылка.Проведен
	|	И СВО.Ссылка В(&СсылкиСВО)
	|	И СВО.КонтрактВЭД = &КонтрактВЭД
	|	И СВО.АвансоваяСправка <> ЗНАЧЕНИЕ(Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПустаяСсылка)
	|	И СВО.Ссылка.Дата <= &Период
	|	И СВО.Ссылка <> &СсылкаСВО
	|
	|СГРУППИРОВАТЬ ПО
	|	СВО.АвансоваяСправка,
	|	СВО.АвансовыйРасчетныйДокумент,
	|	СВО.ВалютаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТекущегоДокумента.АвансоваяСправка,
	|	ДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ДанныеТекущегоДокумента.ВалютаДокумента = &ВалютаКонтракта
	|			ТОГДА ДанныеТекущегоДокумента.СуммаВВалютеДокумента
	|		ИНАЧЕ ДанныеТекущегоДокумента.СуммаВВалютеКонтракта
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ПредварительныеДанныеТекущегоДокумента
	|ИЗ
	|	&ДанныеТекущегоДокумента КАК ДанныеТекущегоДокумента
	|ГДЕ
	|	ДанныеТекущегоДокумента.АвансоваяСправка <> ЗНАЧЕНИЕ(Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныеДанныеТекущегоДокумента.АвансоваяСправка,
	|	ПредварительныеДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент,
	|	СУММА(ПредварительныеДанныеТекущегоДокумента.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ДанныеТекущегоДокумента
	|ИЗ
	|	ПредварительныеДанныеТекущегоДокумента КАК ПредварительныеДанныеТекущегоДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныеДанныеТекущегоДокумента.АвансоваяСправка,
	|	ПредварительныеДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеСПД.Справка КАК Справка,
	|	АвансовыеСПД.Сумма КАК Аванс,
	|	ЕСТЬNULL(ЗакрытыеСПД.Сумма, 0) + ЕСТЬNULL(ДанныеТекущегоДокумента.Сумма, 0) КАК Зачтено,
	|	АвансовыеСПД.Сумма - ЕСТЬNULL(ЗакрытыеСПД.Сумма, 0) - ЕСТЬNULL(ДанныеТекущегоДокумента.Сумма, 0) КАК НеЗачтено,
	|	АвансовыеСПД.РасчетныйДокумент
	|ПОМЕСТИТЬ ДоступныеАвансы
	|ИЗ
	|	АвансовыеСПД КАК АвансовыеСПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытыеСПД КАК ЗакрытыеСПД
	|		ПО АвансовыеСПД.Справка = ЗакрытыеСПД.АвансоваяСправка
	|			И АвансовыеСПД.РасчетныйДокумент = ЗакрытыеСПД.АвансовыйРасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеТекущегоДокумента КАК ДанныеТекущегоДокумента
	|		ПО АвансовыеСПД.Справка = ДанныеТекущегоДокумента.АвансоваяСправка
	|			И АвансовыеСПД.РасчетныйДокумент = ДанныеТекущегоДокумента.АвансовыйРасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеАвансы.Справка КАК Справка,
	|	ДоступныеАвансы.Аванс КАК Аванс,
	|	ДоступныеАвансы.Зачтено КАК Зачтено,
	|	ДоступныеАвансы.НеЗачтено КАК НеЗачтено,
	|	ДоступныеАвансы.РасчетныйДокумент,
	|	ДоступныеАвансы.Справка.Дата КАК Дата
	|ИЗ
	|	ДоступныеАвансы КАК ДоступныеАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Справка";
		
	Период = КонецДня(Параметры.РасчетныйДокумент.Дата);
	Запрос.УстановитьПараметр("КонтрактВЭД", Параметры.КонтрактВЭД);
	Запрос.УстановитьПараметр("ВалютаКонтракта", Параметры.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("СсылкаСВО", Параметры.СсылкаСВО);
	Запрос.УстановитьПараметр("ДанныеТекущегоДокумента", ПолучитьИзВременногоХранилища(Параметры.ДанныеТекущегоДокумента));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СсылкиСВО", РЭЙ_СлужебныйСервер.ПолучитьСсылкиНаАктуальныеСВО(, Период));
	Запрос.УстановитьПараметр("СсылкиСПД", РЭЙ_СлужебныйСервер.ПолучитьСсылкиНаАктуальныеСПД(, Период));
	
    ДанныеДерево = РеквизитФормыВЗначение("Данные");

	ДанныеДерево.Строки.Очистить();
	
	ВыборкаСправки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСправки.Следующий() Цикл
		СтрокаСправки = ДанныеДерево.Строки.Добавить();
		СтрокаСправки.Документ = ВыборкаСправки.Справка;
		СтрокаСправки.ПредставлениеДокумента = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаСправки.Документ);
		
		ВыборкаРасчетныеДокументы = ВыборкаСправки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРасчетныеДокументы.Следующий() Цикл
			СтрокаРасчетныйДокумент = СтрокаСправки.Строки.Добавить();
			СтрокаРасчетныйДокумент.Документ = ВыборкаРасчетныеДокументы.РасчетныйДокумент;
			СтрокаРасчетныйДокумент.ПредставлениеДокумента = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаРасчетныйДокумент.Документ);
			СтрокаРасчетныйДокумент.Аванс = ВыборкаРасчетныеДокументы.Аванс;
			СтрокаРасчетныйДокумент.Зачтено = ВыборкаРасчетныеДокументы.Зачтено;
			СтрокаРасчетныйДокумент.НеЗачтено = ВыборкаРасчетныеДокументы.НеЗачтено;
			СтрокаРасчетныйДокумент.ВалютаКонтракта = Параметры.КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЦикла;
	КонецЦикла;
    ЗначениеВРеквизитФормы(ДанныеДерево, "Данные");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ТекущиеДанные.Документ) = Тип("ДокументСсылка.РЭЙ_СправкаОПодтверждающихДокументах") Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать расчетный документ.");
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = Данные.НайтиПоИдентификатору(ВыбраннаяСтрока).ПолучитьРодителя();
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Справка", СтрокаРодитель.Документ);
	СтруктураВозврата.Вставить("РасчетныйДокумент", Элемент.ТекущиеДанные.Документ);
	СтруктураВозврата.Вставить("Сумма", Элемент.ТекущиеДанные.НеЗачтено);
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры
